{
    "Pan-India “Major” Holidays": [
      {
        "heading": "Diwali / Deepavali",
        "brief": "Diwali, the five-day Festival of Lights, celebrates the triumph of light over darkness and good over evil; families light oil lamps, exchange sweets, and set off fireworks in honor of Lakshmi, the goddess of wealth. (Source: BBC) :contentReference[oaicite:0]{index=0}"
      },
      {
        "heading": "Holi",
        "brief": "Holi, the Festival of Colours, marks the arrival of spring and the victory of good over evil; celebrants throw colored powders and water, dance, and enjoy festive foods like gujiya. (Source: National Geographic) :contentReference[oaicite:1]{index=1}"
      },
      {
        "heading": "Navratri / Durga Puja / Dussehra",
        "brief": "Navratri is a nine-night festival honoring the divine feminine (Devi); in eastern India it culminates in Durga Puja with elaborate clay idols and pandals, while Dussehra (Vijayadashami) celebrates Rama’s victory over Ravana with effigy burnings. (Sources: UNESCO, CNN) :contentReference[oaicite:2]{index=2}"
      },
      {
        "heading": "Ganesh Chaturthi",
        "brief": "Ganesh Chaturthi honors the birth of Ganesha, the elephant-headed god of wisdom; families install clay idols at home or in public pandals and immerse them in water after 1–10 days, symbolizing his return to Mount Kailash. (Source: Smithsonian) :contentReference[oaicite:3]{index=3}"
      },
      {
        "heading": "Janmashtami",
        "brief": "Janmashtami celebrates the birth of Lord Krishna with fasting, night-long vigil, devotional singing, and dramatic reenactments of his childhood (Rasa Lila), culminating at midnight—the traditional hour of his birth. (Source: The Hindu) :contentReference[oaicite:4]{index=4}"
      },
      {
        "heading": "Ram Navami",
        "brief": "Ram Navami marks the birth of Lord Rama with readings of the Ramayana, processions bearing his idols, and devotional singing, especially in Ayodhya, his birthplace. (Source: Hindustan Times) :contentReference[oaicite:5]{index=5}"
      },
      {
        "heading": "Maha Shivaratri",
        "brief": "Maha Shivaratri, the Night of Shiva, is observed with all-night vigils, fasting, and offerings of bilva leaves at Shiva temples, symbolizing overcoming darkness and ignorance. (Source: Britannica) :contentReference[oaicite:6]{index=6}"
      },
      {
        "heading": "Raksha Bandhan",
        "brief": "Raksha Bandhan celebrates the bond between brothers and sisters; sisters tie a protective thread (rakhi) around their brothers’ wrists, and brothers give gifts in return, pledging to protect them. (Source: Times of India) :contentReference[oaicite:7]{index=7}"
      },
      {
        "heading": "Krishna Janmashtami",
        "brief": "See Janmashtami above—the same festival marking Krishna’s birth, often celebrated with Dahi Handi events in Maharashtra, where teams form human pyramids to break a pot of curd hung high. (Source: Indian Express) :contentReference[oaicite:8]{index=8}"
      },
      {
        "heading": "Makar Sankranti",
        "brief": "Makar Sankranti marks the sun’s transit into Capricorn, signaling longer days; celebrated across India with kite flying (Gujarat), potluck feasts (Punjab), and harvesting rituals (Assam). (Source: The Guardian) :contentReference[oaicite:9]{index=9}"
      },
      {
        "heading": "Baisakhi",
        "brief": "Baisakhi, the Punjabi harvest festival and Sikh New Year, features vibrant bhangra dances, langar (community kitchens), and processions in gurudwaras celebrating the formation of the Khalsa. (Source: BBC) :contentReference[oaicite:10]{index=10}"
      },
      {
        "heading": "Pongal",
        "brief": "Pongal is a four-day Tamil harvest festival thanking the Sun god; families cook sweet rice (pongal) in new clay pots and decorate homes with kolam (rice-flour designs). (Source: The Hindu) :contentReference[oaicite:11]{index=11}"
      },
      {
        "heading": "Onam",
        "brief": "Onam, Kerala’s harvest festival, honors the mythical King Mahabali; celebrations include boat races, tiger dances, floral carpets (pookalam), and the grand Onam feast (sadya). (Source: National Geographic) :contentReference[oaicite:12]{index=12}"
      }
    ],
    "Regional or State-level Hindu Festivals": [
      {
        "heading": "Chhath Puja",
        "brief": "Chhath Puja venerates the Sun god with rigorous four-day rituals on riverbanks—holy dips, fasting, and offerings at dawn and dusk—to thank him for sustaining life. (Source: BBC) :contentReference[oaicite:13]{index=13}"
      },
      {
        "heading": "Bhagoriya / Gangaur",
        "brief": "Gangaur, celebrated in Rajasthan, honors Gauri (consort of Shiva) and is marked by colorful processions, folk songs, and the worship of clay idols of the goddess. (Source: Times of India) :contentReference[oaicite:14]{index=14}"
      },
      {
        "heading": "Bengali Ekadashi Observances",
        "brief": "In Bengal, Ekadashi fasts (e.g., Jhulna Yatra) involve devotees swinging (jhulna) idols of Krishna and radha on specially constructed jhulas (swings). (Source: The Hindu) :contentReference[oaicite:15]{index=15}"
      },
      {
        "heading": "Chithirai Thiruvizha",
        "brief": "Madurai’s Chithirai Thiruvizha reenacts the celestial wedding of Meenakshi and Sundareswarar and the festival parade of Alagar to Vaigai river, drawing millions. (Source: UNESCO) :contentReference[oaicite:16]{index=16}"
      },
      {
        "heading": "Gudi Padwa",
        "brief": "Maharashtra’s New Year festival Gudi Padwa marks the sun’s entry into Aries; homes display gilded gudi flags and families exchange sweets. (Source: The Guardian) :contentReference[oaicite:17]{index=17}"
      },
      {
        "heading": "Ugadi",
        "brief": "Ugadi, Telugu and Kannada New Year, features special chutneys symbolizing life’s sour, sweet, and spicy moments, and readings of the Panchanga (almanac). (Source: National Geographic) :contentReference[oaicite:18]{index=18}"
      },
      {
        "heading": "Poila Boishakh",
        "brief": "Poila Boishakh, Bengali New Year, sees shops opening at “Halkhata” ceremonies, cultural programs, and families feasting on traditional sweets. (Source: The Hindu) :contentReference[oaicite:19]{index=19}"
      },
      {
        "heading": "Karthika Mahotsavam",
        "brief": "In Kerala, Karthika Mahotsavam is a month-long festival of lamps at Sabarimala and Guruvayur temples, honoring Lord Ayyappa. (Source: Hindustan Times) :contentReference[oaicite:20]{index=20}"
      },
      {
        "heading": "Karni Mata Fair",
        "brief": "Held in Deshnoke, Rajasthan, this fair venerates Karni Mata at her rat temple, where thousands of black rats roam freely and devotees offer milk. (Source: BBC) :contentReference[oaicite:21]{index=21}"
      },
      {
        "heading": "Hampi Utsav",
        "brief": "Hampi Utsav, Karnataka’s heritage festival, showcases music, dance, and puppet shows amidst the ruins of the Vijayanagara Empire. (Source: UNESCO) :contentReference[oaicite:22]{index=22}"
      }
    ],

    "Temple-Centric or Deity-Centred Festivals": [
    {
      "heading": "Rath Yatra",
      "brief": "An annual chariot festival held in Puri, Odisha, dedicated to Lord Jagannath, where three massive wooden chariots carrying the deities Jagannath, Balabhadra and Subhadra are pulled by thousands of devotees from the Jagannath Temple to the Gundicha Temple and back over the course of a week."
    },
    {
      "heading": "Sabarimala Makara Vilakku",
      "brief": "A sacred festival at the hill shrine of Sabarimala in Kerala during Makar Sankranti, marked by the Thiruvabharanam procession of Lord Ayyappa’s sacred ornaments and the appearance of a holy fire ('Makaravilakku') on Ponnambalamedu, drawing over half a million pilgrims each year."
    },
    {
      "heading": "Tyagaraja Aradhana",
      "brief": "An annual Carnatic music festival in Thiruvaiyaru, Tamil Nadu, commemorating the saint-composer Tyagaraja on the anniversary of his death, during which musicians from across South India gather to render his Pancharatna Kritis."
    },
    {
      "heading": "Tirupati Brahmotsavam",
      "brief": "A nine-day grand celebration at the Sri Venkateswara Temple in Tirumala–Tirupati, Andhra Pradesh, featuring daily processions of the processional deity Malayappa Swami and his consorts on various vahanas (vehicles) through the streets around the temple."
    },
    {
      "heading": "Vaikunta Ekadashi",
      "brief": "The most important Vaishnavite festival at Tirumala in Andhra Pradesh, observed on the 11th day of the bright fortnight of the month of Margashirsha, when the special Vaikunta Dvaram gateway is opened and over 150,000 devotees pass through it to have darshan of Lord Venkateswara."
    },
    {
      "heading": "Chamundeshwari Puja",
      "brief": "The chief ritual of Mysore Dasara in Karnataka, centered on the Chamundeshwari Temple atop Chamundi Hills, where the goddess Chamundeshwari (a form of Durga) is worshipped with elaborate offerings, processions and cultural performances during the ten-day festival."
    }
  ],
  "Folk-Hindu or Tribal-Influenced Observances": [
    {
      "heading": "Chhau Dance Festival",
      "brief": "A cultural festival in Odisha, Jharkhand and West Bengal showcasing Chhau, a semi-classical masked dance form that blends martial movements and folk traditions rooted in tribal rituals."
    },
    {
      "heading": "Kherwal Bird Festival",
      "brief": "Observed by the Kherwal (Santhal) community of Jharkhand on Poush Sankranti, this tribal observance involves offering prayers and food to birds in sacred groves, reflecting the community’s totemic reverence for avifauna and nature worship."
    },
    {
      "heading": "Mopin",
      "brief": "A harvest festival celebrated by the Galo tribe of Arunachal Pradesh in early April, dedicated to the goddess Mopin Ane, believed to bring wealth and prosperity, marked by traditional dances, feasts and community prayers for a bountiful crop."
    }
  ],

    "Major Pan-India Islamic Holidays": [
      {
        "heading": "Eid‑ul‑Fitr",
        "brief": "Celebrated at the end of Ramadan, Eid‑ul‑Fitr involves communal prayers, charity (zakat al‑fitr), lavish meals, and social visits."
      },
      {
        "heading": "Eid‑ul‑Adha (Bakrid)",
        "brief": "Marking Ibrahim’s willingness to sacrifice his son, Eid‑ul‑Adha includes animal sacrifice, meat distribution, prayers, and pilgrim reflections after Hajj."
      },
      {
        "heading": "Muharram / Ashura",
        "brief": "The first month of the Islamic calendar; Ashura commemorates Imam Husayn’s martyrdom for Shias, and Sunni traditions include fasting."
      },
      {
        "heading": "Milad‑un‑Nabi (Mawlid)",
        "brief": "Observance of Prophet Muhammad’s birthday, with recitations of his life, special prayers, charity, and communal meals."
      },
      {
        "heading": "Shab‑e‑Meras (Shab‑e‑Isra‑wa‑Miraj)",
        "brief": "Remembers Prophet Muhammad’s night journey to heaven; marked with late-night prayers and Quran recitations."
      },
      {
        "heading": "Shab‑e‑Barat",
        "brief": "The Night of Forgiveness—believed to determine fate for the next year; Muslims pray for forgiveness and visit graves."
      },
      {
        "heading": "Ramadan",
        "brief": "A month of fasting from dawn to sunset, special nightly Taraweeh prayers and reflection to commemorate the Quran’s first revelation."
      }
    ],
    "Regional Islamic Commemorations or Urs Festivals": [
      {
        "heading": "Ajmer Urs",
        "brief": "Annual death anniversary of Sufi saint Khwaja Moinuddin Chishti at Ajmer Sharif Dargah, attracting pilgrims across faiths."
      },
      {
        "heading": "Khambat Urs",
        "brief": "Annual Urs of Sufi saint Qutbuddin Bakhtiar Khaki in Khambat (Gujarat), featuring devotional music and gatherings."
      },
      {
        "heading": "Basara Urs",
        "brief": "Honours local Sufi saints in Telangana; involves qawwali singing at shrines and communal meals."
      }
    ],
    "Major Sikh Observances": [
      {
        "heading": "Gurpurabs",
        "brief": "Anniversaries of Sikh Gurus’ births/deaths—especially Guru Nanak and Guru Gobind Singh—marked by processions, kirtan, and community kitchens."
      },
      {
        "heading": "Vaisakhi",
        "brief": "Baisakhi marks the formation of the Khalsa and Punjabi harvest; features vibrant processions, gurdwara services and bhangra."
      },
      {
        "heading": "Hola Mohalla",
        "brief": "Held after Holi in Anandpur Sahib; martial displays, mock battles, poetry and community meals showcase Sikh valor."
      },
      {
        "heading": "Maghi Mela",
        "brief": "In Muktsar, commemorates the 40 Sikh martyrs; devotees take dips and attend gurudwara services."
      },
      {
        "heading": "Parkash Utsav",
        "brief": "Day celebrating the installation of Guru Granth Sahib; includes akhand paths and devotional singing."
      },
      {
        "heading": "Martyrdom Days",
        "brief": "Observed for Sahibzada Zorawar & Fateh Singh, and Guru Tegh Bahadur—marked by prayer and remembrance."
      }
    ],
    "Regional Gurudwara Melas": [
      {
        "heading": "Anandpur Sahib Hola Mohalla",
        "brief": "Large-scale martial arts & religious gathering with performances and langar, centred on Anandpur Sahib."
      },
      {
        "heading": "Ramgarhia Bunga Fair",
        "brief": "Held at Amritsar’s Ramgarhia Bunga—features music, communal kitchens, religious readings, and community fellowship."
      }
    ],
    "Pan-India Christian Observances": [
      {
        "heading": "Christmas",
        "brief": "Celebrating Jesus Christ’s birth on December 25 with church services, carols, nativity displays, and festive meals."
      },
      {
        "heading": "Good Friday / Easter Sunday",
        "brief": "Commemorates Jesus’ crucifixion (Good Friday) and resurrection (Easter Sunday), with solemn services and choirs."
      },
      {
        "heading": "Palm Sunday",
        "brief": "Marks Jesus' entry into Jerusalem—processions with palm fronds at church entrances."
      },
      {
        "heading": "Epiphany / Theophany",
        "brief": "January 6 observance in some denominations, celebrating the visit of the Magi and the manifestation of Christ."
      },
      {
        "heading": "Pentecost",
        "brief": "Fiftieth day after Easter, commemorating the Holy Spirit’s descent; churches hold special prayers and hymns."
      },
      {
        "heading": "All Saints’ Day / All Souls’ Day",
        "brief": "November 1–2 remembrance of saints and departed souls, with church services and prayers."
      }
    ],
    "Regional or Denominational Celebrations": [
      {
        "heading": "Feast of St Francis Xavier",
        "brief": "December 3 feast in Goa celebrating the missionary’s legacy; features church processions and Konkani hymns."
      },
      {
        "heading": "Feast of St Thomas",
        "brief": "July 3 celebration in Kerala recognizing Apostle Thomas’ arrival—marked with masses and pilgrimages."
      },
      {
        "heading": "Saint Kuriakose Elias Chavara Feast",
        "brief": "Kerala feast day honoring this 19th‑century Catholic reformer, celebrated with prayer and local events."
      },
      {
        "heading": "Mount St Thomas Annual Pilgrimage",
        "brief": "Pilgrimage in Kerala to Mount St. Thomas shrine, with masses and family gatherings."
      },
      {
        "heading": "East Indian Community Feasts",
        "brief": "Mumbai feasts celebrated by the local Catholic community—marked with processions, liturgies, and shared meals."
      },
      {
        "heading": "Portuguese‑style Processions in Goa",
        "brief": "Traditional Good Friday Way of the Cross and Easter processions reflecting colonial-era liturgy and music."
      }
    ],

    "Major Jain Observances": [
      {
        "heading": "Mahavir Jayanti",
        "brief": "Celebrates the birth of Lord Mahavira, the 24th Tirthankara; observed with processions, temple rituals, and lectures on non-violence."
      },
      {
        "heading": "Paryushana / Das Lakshan Parva",
        "brief": "Eight to ten-day period of fasting, repentance, scripture reading, and forgiveness rituals among Jains."
      },
      {
        "heading": "Diwali (Jain Parinirvana)",
        "brief": "Marks Lord Mahavira’s liberation (nirvana); observed with temple lamps, scriptures, and reflection on spiritual liberation."
      },
      {
        "heading": "Kartik Purnima (Kshamavani)",
        "brief": "Śvētāmbara forgiveness day—Jains ask forgiveness from all beings for offenses committed in the past year."
      },
      {
        "heading": "Ranakpur Mahotsav",
        "brief": "Festival at Ranakpur’s Jain temples in Rajasthan featuring rituals, lights, music, and pilgrim visits."
      }
    ],
    "Regional Jain Temple Festivals": [
      {
        "heading": "Shravanabelagola Mahamastakabhisheka",
        "brief": "Ritual bathing of the 57‑ft Gommateshwara statue in Karnataka, held every 12 years with devotees applying sacred powders."
      },
      {
        "heading": "Shikharji Yatra",
        "brief": "Pilgrimage to Shikharji hills in Jharkhand—the most sacred Jain site—where devotees climb temples honoring liberated souls."
      }
    ],
    "Pan-Buddhist Observances in India": [
      {
        "heading": "Buddha Purnima / Vesak",
        "brief": "Commemorates Buddha’s birth, enlightenment, and nirvana with prayers, processions, and meditation at Buddhist temples."
      },
      {
        "heading": "Magha Puja",
        "brief": "Also called Sangha Day—honors Buddha and his disciples with candlelit processions and teachings at temples like Sarnath."
      },
      {
        "heading": "Loy Krathong",
        "brief": "Water lantern festival observed in Northeast India, where lighted floats are set adrift for purification."
      },
      {
        "heading": "Dhamma Chakra Pravartan Din",
        "brief": "International Buddhist Day, celebrated at Sarnath where Buddha delivered his first discourse—includes sermons and ceremonies."
      }
    ],
    "Region-Specific Celebrations": [
      {
        "heading": "Losar",
        "brief": "Tibetan New Year celebrated in Ladakh, Sikkim and Arunachal with prayers, dances, and family gatherings."
      },
      {
        "heading": "Saga Dawa",
        "brief": "Tibetan observance of Buddha’s birth, enlightenment, and death—entails merit‑making like prostrations and lantern lighting."
      },
      {
        "heading": "Ambedkar Jayanti",
        "brief": "On April 14, Neo-Buddhists honor Dr. B.R. Ambedkar’s conversion to Buddhism and social reform legacy."
      }
    ],
    "Guinness-Recognized Observances": [
      {
        "heading": "Nowruz / Navroz",
        "brief": "Zoroastrian New Year celebrated on March 21 with house cleaning, prayers, Haft-Seen table, and festive meals."
      },
      {
        "heading": "Jamshedi Navroz",
        "brief": "Traditional Parsi New Year involving prayers at fire temples and gatherings with traditional food."
      },
      {
        "heading": "Khordad Sal",
        "brief": "Birth anniversary of Prophet Zarathustra celebrated with ritual prayers, donation, and community feasts."
      },
      {
        "heading": "Pateti",
        "brief": "Day before Navroz devoted to reflection and repentance for one’s past misdeeds."
      },
      {
        "heading": "Mehergan",
        "brief": "Autumn harvest festival with thanks to the sun, charity, and communal feasting."
      },
      {
        "heading": "Bahman Mahino",
        "brief": "A fire-themed ancient celebration honoring spirits of fire with prayers at Atash Behrams."
      },
      {
        "heading": "Khordad Roj",
        "brief": "Monthly religious celebration honoring creation and divine perfection."
      }
    ],
    "Common Observances (in small Indian Jewish communities)": [
      {
        "heading": "Passover / Pesach",
        "brief": "Commemorates the Exodus from Egypt with seders, unleavened bread, and scriptural readings."
      },
      {
        "heading": "Yom Kippur",
        "brief": "Day of Atonement marked by 25-hour fast, repentance, and intensive synagogue prayer."
      },
      {
        "heading": "Rosh Hashanah",
        "brief": "Jewish New Year celebrated with shofar blowing, prayers, and festive meals."
      },
      {
        "heading": "Chanukah",
        "brief": "Festival of Lights with menorah lighting, dreidel games, and oil-based snacks over eight nights."
      },
      {
        "heading": "Purim",
        "brief": "Celebrates salvation of Jewish people in Persia—marked with reading the Megillah, costumes, and feasting."
      },
      {
        "heading": "Sukkot",
        "brief": "Feast of Booths; build and dwell in sukkah huts to commemorate the Exodus wandering."
      },
      {
        "heading": "Simchat Torah",
        "brief": "Joyful marking of Torah reading cycle completion with dancing and Torah processions."
      },
      {
        "heading": "Shavuot",
        "brief": "Festival of Weeks celebrating giving of Torah at Sinai; observed with dairy foods and all-night study."
      }
    ],
    "Harvest-Based Tribal Festivals": [
      {
        "heading": "Karam",
        "brief": "Santals, Gonds, and others honor the Karam tree deity with offerings, dances and communal feasts."
      },
      {
        "heading": "Baha",
        "brief": "Bodo flower festival in Assam celebrating spring with floral offerings and Bwisagu dances."
      },
      {
        "heading": "Mopin",
        "brief": "Apatani prosperity festival in Arunachal featuring mask dances, livestock blessings and rice feasts."
      },
      {
        "heading": "Bhagoria Haat",
        "brief": "Bharia tribal wedding fair in Madhya Pradesh where youth meet and Pariyan dances occur."
      }
    ],
    "Rain or Water-Related Ritual Festivals": [
      {
        "heading": "Jhumur",
        "brief": "Eastern tribal harvest dance festival with rhythmic group dances after harvest."
      },
      {
        "heading": "Phuh‑er Baisi",
        "brief": "Naga pre-harvest festival involving ritual offerings of meat and rice to invoke bounty."
      },
      {
        "heading": "Kut Festival",
        "brief": "Mizoram thanksgiving for harvest in March/April featuring feasts and folk songs."
      }
    ],
    "Ancestral or Spirit-Worship Festivals": [
      {
        "heading": "Tor‑Sangam",
        "brief": "Arunachali ritual for the Singhpoo tribe venerating ancestral spirits through offerings."
      },
      {
        "heading": "Gundru",
        "brief": "Khandeshi tribal worship in Maharashtra invoking local deities for health and fortune."
      },
      {
        "heading": "Aori Kol",
        "brief": "Jharkhand tribal festival honoring nature deities with animal sacrifices and community meals."
      }
    ],
    "Folk-Dance and Music Celebrations (Ritual Theater)": [
      {
        "heading": "Chhau Festival",
        "brief": "Mask dance tradition of Odisha/Jharkhand blending martial movements and mythological themes."
      },
      {
        "heading": "Kalbelia Cultural Festival",
        "brief": "Rajasthani snake-charmer community performs gyrating dances and folk songs."
      }
    ],

    "Mid-Winter or January Festivals": [
      {
        "heading": "Lohri",
        "brief": "Celebrated in Punjab and North India, Lohri marks the end of winter with bonfires, folk songs, dances, and harvest offerings."
      },
      {
        "heading": "Makar Sankranti",
        "brief": "Observed nationwide, it marks the sun's shift into Capricorn and is celebrated with kite-flying, sesame sweets, and harvest rituals."
      },
      {
        "heading": "Pongal",
        "brief": "Tamil Nadu’s harvest festival thanking the Sun god with boiled sweet rice and traditional rituals over four days."
      }
    ],
    "Spring Festivals (February–April)": [
      {
        "heading": "Vasant Panchami",
        "brief": "Marks the onset of spring and is dedicated to Saraswati, the goddess of wisdom, with yellow clothing and feasts."
      },
      {
        "heading": "Ugadi",
        "brief": "New Year festival in Andhra Pradesh, Telangana, and Karnataka, celebrated with neem-jaggery chutney and Panchanga Shravanam."
      },
      {
        "heading": "Gudi Padwa",
        "brief": "Maharashtra’s New Year festival with gudi flags, neem-based dishes, and prayers to mark spring."
      },
      {
        "heading": "Baisakhi",
        "brief": "Sikh and Punjabi New Year, also marking wheat harvest, with fairs, bhangra, and gurdwara processions."
      }
    ],
    "Summer Festivals (May–July)": [
      {
        "heading": "Buddha Purnima",
        "brief": "Commemorates the Buddha’s birth, enlightenment, and death with prayers and acts of compassion."
      },
      {
        "heading": "Saga Dawa",
        "brief": "Tibetan Buddhist festival honoring Buddha’s life events with lanterns, chants, and charity."
      },
      {
        "heading": "Ambubachi Mela",
        "brief": "Held at Kamakhya Temple in Assam, marks the goddess's menstruation with temple closure, rituals, and tantric observances."
      }
    ],
    "Monsoon and Late Summer Festivals (July–September)": [
      {
        "heading": "Teej",
        "brief": "Observed by women in North India and Nepal with fasting and songs, praying for marital bliss and monsoon prosperity."
      },
      {
        "heading": "Raksha Bandhan",
        "brief": "Sisters tie rakhi on brothers’ wrists symbolizing protection; celebrated during Shravan Purnima."
      },
      {
        "heading": "Onam",
        "brief": "Kerala’s biggest festival with floral rangolis, snake boat races, and grand vegetarian feasts."
      }
    ],
    "Autumn and Diwali Season (September–November)": [
      {
        "heading": "Navratri / Durga Puja",
        "brief": "Nine nights of goddess worship with dance (Garba/Dandiya) and idol immersion rituals in Bengal and Gujarat."
      },
      {
        "heading": "Dussehra",
        "brief": "Symbolizes the victory of Rama over Ravana and Durga over Mahishasura; celebrated with effigy burning and pageants."
      },
      {
        "heading": "Diwali",
        "brief": "Festival of Lights celebrated across India with diyas, fireworks, sweets, and prayers to Lakshmi."
      }
    ],
    "Early Winter and Christmas Season (November–January)": [
      {
        "heading": "Guru Nanak Jayanti",
        "brief": "Birth of Guru Nanak celebrated with Prabhat Pheris, langars, and Akhand Path readings."
      },
      {
        "heading": "Christmas",
        "brief": "Marks the birth of Jesus Christ with church services, nativity plays, carols, and festive meals."
      }
    ],

    "North India (Group of States)": [
      {
        "heading": "Lohri",
        "brief": "Celebrated in Punjab and Himachal Pradesh, Lohri marks winter’s end with bonfires, folk dances, and songs."
      },
      {
        "heading": "Baisakhi",
        "brief": "Punjabi New Year and harvest festival; also commemorates the formation of the Khalsa in Sikhism."
      },
      {
        "heading": "Kullu Dussehra",
        "brief": "A week-long celebration in Himachal's Kullu Valley, with grand processions of local deities."
      },
      {
        "heading": "Phool Dei",
        "brief": "Springtime festival in Uttarakhand; children decorate doorsteps with flowers for prosperity."
      },
      {
        "heading": "Nanda Devi Raj Jat Yatra",
        "brief": "Sacred pilgrimage festival in Uttarakhand held once every 12 years in honor of Nanda Devi."
      },
      {
        "heading": "Chhath Puja",
        "brief": "Sun worship ritual held at riverbanks in Bihar, Jharkhand, and eastern Uttar Pradesh."
      },
      {
        "heading": "Nauchandi Mela",
        "brief": "Annual fair in Meerut, UP, combining Hindu-Muslim cultural heritage with crafts and rituals."
      },
      {
        "heading": "Sonepur Cattle Fair",
        "brief": "Held in Bihar, this is Asia’s largest cattle and livestock fair, with spiritual and commercial attractions."
      },
      {
        "heading": "Bhringi Mela",
        "brief": "Religious and folk fair in Garhwal (Uttarakhand), dedicated to local deities."
      },
      {
        "heading": "Qutub Festival",
        "brief": "Cultural festival at Delhi's Qutub Minar showcasing classical music and dance."
      },
      {
        "heading": "Phool Walon Ki Sair",
        "brief": "Interfaith floral procession in Delhi promoting harmony among communities."
      }
    ],
    "West India": [
      {
        "heading": "Ganesh Chaturthi",
        "brief": "Especially prominent in Maharashtra with large idol processions and immersion."
      },
      {
        "heading": "Gudi Padwa",
        "brief": "Maharashtrian New Year celebrated with decorated gudis and sweets."
      },
      {
        "heading": "Ellora Ajanta Festival",
        "brief": "Dance and music festival at Aurangabad’s famous cave temples."
      },
      {
        "heading": "Carnival",
        "brief": "Goa’s four-day street festival of floats, costumes, and parades before Lent."
      },
      {
        "heading": "Shigmo",
        "brief": "Goan spring festival with processions, folk dances, and cultural themes."
      },
      {
        "heading": "Feast of St. Francis Xavier",
        "brief": "Held in Goa on December 3, commemorates the saint’s legacy with pilgrimages and masses."
      },
      {
        "heading": "Rann Utsav",
        "brief": "Kutch’s white desert festival with crafts, music, dance, and tented tourism."
      },
      {
        "heading": "International Kite Festival",
        "brief": "Held during Makar Sankranti in Gujarat; skies filled with colorful kites."
      },
      {
        "heading": "Vadodara Navratri",
        "brief": "Famous for live Garba and Dandiya Raas during Navratri."
      },
      {
        "heading": "Pushkar Camel Fair",
        "brief": "Major Rajasthan fair combining camel trading and Vaishnavite rituals."
      },
      {
        "heading": "Teej",
        "brief": "Monsoon festival for women in Rajasthan, observed with swings, fasts, and songs."
      },
      {
        "heading": "Desert Festival",
        "brief": "Jaisalmer hosts this with folk music, camel races, and traditional arts."
      },
      {
        "heading": "Bikaner Camel Festival",
        "brief": "Celebrates camels with parades, performances, and decorations in Bikaner."
      }
    ],
    "East India": [
      {
        "heading": "Durga Puja",
        "brief": "West Bengal’s most iconic festival with elaborate pandals and idols of Goddess Durga."
      },
      {
        "heading": "Poila Boishakh",
        "brief": "Bengali New Year celebrated with processions, fairs, and cultural performances."
      },
      {
        "heading": "Kali Puja",
        "brief": "Held around Diwali, with late-night worship of Goddess Kali especially in Bengal."
      },
      {
        "heading": "Rath Yatra",
        "brief": "Chariot procession of Lord Jagannath in Puri, Odisha—drawing millions of devotees."
      },
      {
        "heading": "Konark Dance Festival",
        "brief": "Odisha’s classical dance festival held at the Sun Temple in Konark."
      },
      {
        "heading": "Manasa Puja",
        "brief": "Tribal serpent-worship rituals in eastern Bihar regions."
      },
      {
        "heading": "Hiran Mela",
        "brief": "Local Murshidabad celebration with crafts, foods, and tribal performances."
      }
    ],
    "Northeast India": [
      {
        "heading": "Bihu",
        "brief": "Assam’s main festival (Rongali, Kongali, Bhogali) with dances, food, and harvest rituals."
      },
      {
        "heading": "Ambubachi Mela",
        "brief": "Held at Kamakhya Temple, Assam; marks fertility of the goddess and draws tantrics and pilgrims."
      },
      {
        "heading": "Majuli Raas Festival",
        "brief": "Spiritual dance-drama of Krishna’s life performed at Satras on Majuli island."
      },
      {
        "heading": "Kharchi Puja",
        "brief": "Tripura’s tribal festival worshipping 14 deities with rituals and public feasts."
      },
      {
        "heading": "Hojagiri",
        "brief": "Folk dance festival of the Reang/Mizo communities in Tripura."
      },
      {
        "heading": "Nongkrem Dance Festival",
        "brief": "Meghalaya’s Khasi celebration of the harvest and fertility of the land."
      },
      {
        "heading": "Wangala",
        "brief": "Drum-based harvest dance festival of the Garo tribe in Meghalaya."
      },
      {
        "heading": "Hornbill Festival",
        "brief": "Nagaland’s ‘Festival of Festivals’, showcasing all Naga tribal culture and cuisine."
      },
      {
        "heading": "Sekrenyi",
        "brief": "Angami Naga New Year with rituals of purification, dances, and songs."
      },
      {
        "heading": "Chapchar Kut",
        "brief": "Mizo spring festival celebrated with bamboo dances and community feasting."
      },
      {
        "heading": "Kut Festival",
        "brief": "Harvest thanksgiving of the Kuki-Chin-Mizo tribes of Manipur and Mizoram."
      },
      {
        "heading": "Yaoshang",
        "brief": "Manipur’s six-day Holi variant with sports, dancing, and devotional events."
      },
      {
        "heading": "Lai Haraoba",
        "brief": "Meitei ritual festival in Manipur honoring forest deities through dance and music."
      }
    ],
    "South India": [
      {
        "heading": "Pongal",
        "brief": "Tamil harvest festival celebrated with rice cooking, rangolis, and cattle decoration."
      },
      {
        "heading": "Karthigai Deepam",
        "brief": "Festival of Lights in Tamil Nadu, with oil lamps lit in homes and temples."
      },
      {
        "heading": "Mahamaham",
        "brief": "Held every 12 years at Kumbakonam; sacred bath and rituals in temple tanks."
      },
      {
        "heading": "Chithirai Thiruvizha",
        "brief": "Madurai's reenactment of Meenakshi’s divine marriage with processions and temple rituals."
      },
      {
        "heading": "Thaipusam",
        "brief": "Dedicated to Murugan; devotees undertake kavadi offerings in Tamil Nadu and Malaysia."
      },
      {
        "heading": "Thrissur Pooram",
        "brief": "Kerala’s temple festival with decorated elephants, percussion ensembles, and fireworks."
      },
      {
        "heading": "Aranmula Boat Race",
        "brief": "Traditional snake-boat race linked to Parthasarathy Temple and Krishna legends."
      },
      {
        "heading": "Vishu",
        "brief": "Kerala New Year festival; homes are decorated with Vishukkani (auspicious items)."
      },
      {
        "heading": "Attukal Pongala",
        "brief": "Women-centric festival at Attukal Bhagavathy Temple; over 3 million women cook offerings."
      },
      {
        "heading": "Mysore Dasara",
        "brief": "Royal festival in Karnataka with parades, music, and the Jumbo Savari elephant procession."
      },
      {
        "heading": "Hampi Utsav",
        "brief": "Karnataka’s heritage festival showcasing the ruins of Vijayanagara with music and dance."
      },
      {
        "heading": "Kadlekai Parishe",
        "brief": "Bangalore’s traditional peanut fair, held annually in Basavanagudi."
      },
      {
        "heading": "Ugadi",
        "brief": "New Year festival for Andhra Pradesh, Telangana, and Karnataka; marked with symbolic foods."
      },
      {
        "heading": "Bathukamma",
        "brief": "Women’s floral festival in Telangana celebrating Goddess Gauri."
      }
    ],

    "Tribal Harvest and Nature Festivals": [
      {
        "heading": "Karam",
        "brief": "Primarily celebrated by tribal communities in Jharkhand, Odisha, and West Bengal, Karam worships the Karam tree, a symbol of fertility and prosperity."
      },
      {
        "heading": "Sarhul",
        "brief": "A spring festival of the Oraon tribe in Jharkhand, marking the beginning of the new year with flower offerings to Sal trees and ancestor worship."
      },
      {
        "heading": "Baha",
        "brief": "Santhal flower festival in Jharkhand and Bengal, where tribal priests offer sal blossoms to spirits, accompanied by songs and traditional dance."
      },
      {
        "heading": "Madai",
        "brief": "Tribal festival of the Gonds in Chhattisgarh involving rituals, animal sacrifice, and fairs held in sacred groves."
      },
      {
        "heading": "Chherta",
        "brief": "Gond and Baiga tribal agricultural festival in Madhya Pradesh celebrating crop growth with music and community feasting."
      }
    ],
    "Folk-Theatre and Ritual Dances (Often Festival-Based)": [
      {
        "heading": "Chhau Festival",
        "brief": "A masked dance festival in Jharkhand, Odisha, and West Bengal that blends martial arts, classical dance, and local mythology."
      },
      {
        "heading": "Gussadi Festival",
        "brief": "A Telangana tribal celebration by the Raj Gonds with feathered headdresses, body painting, and processions."
      },
      {
        "heading": "Gotipua Festival",
        "brief": "Traditional Odishan dance by boys dressed as females, seen as the precursor to Odissi dance."
      },
      {
        "heading": "Tusu Festival",
        "brief": "Folk harvest festival in Bengal and Jharkhand featuring Tusu songs sung by unmarried women and clay idol immersions."
      },
      {
        "heading": "Dhobi Naach",
        "brief": "A folk-dance ritual of the washerman community (Dhobis), performed in central India during local festivals."
      }
    ],
    "Village-Level and Clan-Level Rituals": [
      {
        "heading": "Bhojli",
        "brief": "Observed by village women in Chhattisgarh, where green gram saplings are nurtured as symbols of prosperity and offered in water bodies."
      },
      {
        "heading": "Pithori Amavasya",
        "brief": "Clan ritual in western India for maternal ancestors; women make 64 clay images of goddesses and offer special food."
      },
      {
        "heading": "Budhi Diwali",
        "brief": "Celebrated weeks after mainstream Diwali in certain Himachal villages with bonfires, rural theatre, and goat sacrifice."
      },
      {
        "heading": "Dev Uthani Ekadashi",
        "brief": "A village-level ritual marking the symbolic waking of gods after a four-month slumber—linked to wedding season."
      },
      {
        "heading": "Patharchatti",
        "brief": "An obscure clan ritual from tribal Bihar involving prayers to a deity symbolized by stones and food offerings."
      }
    ],

    "Republic Day (January 26)": [
      {
        "heading": "Republic Day",
        "brief": "Celebrated on January 26 to honor the adoption of India’s Constitution; features a grand parade at Rajpath in New Delhi showcasing cultural tableaux, military might, and patriotic performances."
      }
    ],
    "Independence Day (August 15)": [
      {
        "heading": "Independence Day",
        "brief": "Commemorates India's independence from British rule in 1947; the Prime Minister addresses the nation from the Red Fort, followed by flag-hoisting ceremonies and cultural events across the country."
      }
    ],
    "Gandhi Jayanti (October 2)": [
      {
        "heading": "Gandhi Jayanti",
        "brief": "Marks the birth anniversary of Mahatma Gandhi, the father of the nation; observed with prayer services, cleanliness drives, and non-violence pledges."
      }
    ],
    "Swami Vivekananda Jayanti (January 12)": [
      {
        "heading": "National Youth Day",
        "brief": "Celebrated on Swami Vivekananda’s birth anniversary; youth programs, speeches, and cultural activities are held in his honor across educational institutions."
      }
    ],
    "Netaji Subhas Chandra Bose Jayanti (January 23)": [
      {
        "heading": "Parakram Diwas",
        "brief": "Observed to honor Netaji Subhas Chandra Bose’s leadership and valor; includes patriotic parades, exhibitions, and discussions on his legacy."
      }
    ],
    "Martyrs’ Day (January 30)": [
      {
        "heading": "Martyrs’ Day",
        "brief": "Commemorates the assassination of Mahatma Gandhi in 1948; two minutes of silence is observed nationwide in honor of freedom fighters."
      }
    ],
    "National Integration Day (November 19)": [
      {
        "heading": "National Integration Day",
        "brief": "Celebrated on Indira Gandhi’s birth anniversary to promote unity in diversity; observed with cultural programs and interfaith dialogues."
      }
    ],
    "Classical Dance and Music Festivals": [
      {
        "heading": "Khajuraho Dance Festival",
        "brief": "Held in Madhya Pradesh’s Khajuraho temples, this festival showcases classical Indian dance forms like Bharatanatyam, Kathak, and Odissi."
      },
      {
        "heading": "Natyanjali Festival",
        "brief": "Celebrated at Chidambaram Temple in Tamil Nadu, dedicated to Lord Nataraja with classical dance performances."
      },
      {
        "heading": "Chennai Music Season",
        "brief": "A December-January cultural series showcasing Carnatic music concerts and Bharatnatyam performances across Chennai."
      }
    ],
    "Folk-Arts and Crafts Fairs": [
      {
        "heading": "Surajkund Mela",
        "brief": "Held in Haryana, it's India’s largest crafts fair featuring traditional arts, music, dance, and regional cuisines from across the country."
      },
      {
        "heading": "Shilpgram Utsav",
        "brief": "Hosted in Udaipur, Rajasthan, this fair promotes rural crafts, tribal art, and folk performances."
      },
      {
        "heading": "Sanskriti Mahotsav",
        "brief": "A multi-day cultural fest celebrating India’s regional heritage through folk dances, theater, and handicrafts."
      }
    ],
    "Literature and Poetry Festivals": [
      {
        "heading": "Jaipur Literature Festival",
        "brief": "The world’s largest free literary event, featuring global authors, debates, book readings, and cultural exchange."
      },
      {
        "heading": "Kalinga Literary Festival",
        "brief": "Held in Odisha, it brings together writers, poets, and scholars to discuss literature, democracy, and culture."
      },
      {
        "heading": "Kerala Literature Festival",
        "brief": "Held at Kozhikode beach, featuring national and international writers and intellectual discussions."
      }
    ],
    "Film Festivals": [
      {
        "heading": "International Film Festival of India (IFFI)",
        "brief": "Held annually in Goa, it screens international and Indian films and presents awards for cinematic excellence."
      },
      {
        "heading": "Mumbai International Film Festival (MIFF)",
        "brief": "Showcases documentary, short, and animation films from across the world."
      },
      {
        "heading": "Dharamshala International Film Festival",
        "brief": "Independent film festival held in the Himalayas promoting creative storytelling and regional cinema."
      }
    ],
    "Theatre and Performing-Arts Festivals": [
      {
        "heading": "Bharat Rang Mahotsav",
        "brief": "India’s largest theater festival organized by the National School of Drama in Delhi featuring multilingual performances."
      },
      {
        "heading": "Prithvi Theatre Festival",
        "brief": "Mumbai-based annual festival celebrating Indian performing arts through contemporary and traditional plays."
      }
    ],
    "Film and Media-Specific Fairs or Conclaves": [
      {
        "heading": "India International Animation and Cartoon Film Festival",
        "brief": "Platform for animators, cartoonists, and media creators to showcase their work and network."
      },
      {
        "heading": "FICCI Frames",
        "brief": "Annual media and entertainment industry convention including film screenings and policy discussions."
      }
    ],
    "Heritage and History Festivals": [
      {
        "heading": "World Heritage Week",
        "brief": "Celebrated in November across India’s ASI-protected monuments with awareness drives, exhibitions, and cultural tours."
      },
      {
        "heading": "Hampi Utsav",
        "brief": "Festival in Karnataka celebrating the Vijayanagara Empire’s legacy with music, dance, and historical reenactments."
      },
      {
        "heading": "Taj Mahotsav",
        "brief": "Held in Agra near the Taj Mahal, celebrating Mughal culture through arts, cuisine, and handicrafts."
      }
    ],

    "Regional Cuisine Festivals": [
      {
        "heading": "National Street Food Festival",
        "brief": "Organized in Delhi by NASVI, showcasing traditional street foods from all Indian states."
      },
      {
        "heading": "Goa Food and Cultural Festival",
        "brief": "Celebrates Goan seafood, spices, and fusion cuisine with live cooking and musical entertainment."
      },
      {
        "heading": "Ahare Bangla",
        "brief": "Held in Kolkata, this event features Bengali cuisine from traditional to modern interpretations, along with food entrepreneurship showcases."
      }
    ],
    "Wine and Beer Festivals": [
      {
        "heading": "SulaFest",
        "brief": "A music and wine festival held at Sula Vineyards in Nashik, Maharashtra, with wine tasting, live music, and gourmet food."
      },
      {
        "heading": "India Wine Awards",
        "brief": "Annual celebration of Indian and international wines with tastings and awards hosted by sommeliers and connoisseurs."
      },
      {
        "heading": "Bangalore Brew Fest",
        "brief": "Craft beer festival featuring local breweries, food pairings, and live performances."
      }
    ],
    "Street-Food and Chaat Festivals": [
      {
        "heading": "Delhi Chaat Festival",
        "brief": "A popular food carnival showcasing regional chaats and snacks from across India with cooking contests and tastings."
      },
      {
        "heading": "Lucknow Tunday Kebab Fest",
        "brief": "Celebrates the iconic Awadhi kebabs and Mughlai delicacies unique to Lucknow."
      }
    ],

    "Earth Day Celebrations": [
      {
        "heading": "Earth Day India",
        "brief": "Observed on April 22 with tree-planting drives, school events, climate workshops, and awareness campaigns across urban and rural areas."
      }
    ],
    "India Eco Film Festival": [
      {
        "heading": "India Environment Film Festival",
        "brief": "Hosts screenings of short films and documentaries on ecology, biodiversity, and climate justice from India and abroad."
      }
    ],
    "Zero Waste India Summit and Expo": [
      {
        "heading": "Zero Waste India Expo",
        "brief": "Conference promoting circular economy and waste-free living with exhibits on recycling, upcycling, and green technology."
      }
    ],
    "Chennai Climate Fest": [
      {
        "heading": "Chennai Climate Action Festival",
        "brief": "Focuses on community-led solutions for sustainability through art, performances, and youth initiatives."
      }
    ],
    "Wildlife Week Celebrations": [
      {
        "heading": "Wildlife Week India",
        "brief": "Celebrated during the first week of October with wildlife photography contests, conservation pledges, and forest awareness programs."
      }
    ],

    "Battle of Saraighat Commemoration": [
      {
        "heading": "Saraighat Utsav",
        "brief": "Held in Assam to commemorate the 1671 battle led by Lachit Borphukan against the Mughals; includes parades, lectures, and reenactments."
      }
    ],
    "Mangal Pandey Jayanti": [
      {
        "heading": "Mangal Pandey Day",
        "brief": "Observed in Uttar Pradesh to honor the 1857 revolutionary; marked by patriotic speeches and cultural programs."
      }
    ],
    "Jhansi Laxmi Bai Utsav": [
      {
        "heading": "Rani Laxmi Bai Festival",
        "brief": "Celebrated in Jhansi with parades, horse shows, and women’s empowerment events honoring the warrior queen."
      }
    ],
    "Tipu Sultan Jayanti": [
      {
        "heading": "Tipu Sultan Jayanti",
        "brief": "Marked in Karnataka with official functions and historical exhibitions celebrating Tipu Sultan’s resistance against British rule."
      }
    ],
    "Mysore Dasara": [
      {
        "heading": "Mysuru Dasara",
        "brief": "Royal festival in Karnataka featuring the grand Jumbo Savari procession and cultural programs celebrating the Wodeyar dynasty."
      }
    ],

    "Goa Carnival": [
      {
        "heading": "Goa Carnival",
        "brief": "Four-day pre-Lenten festival of floats, costumes, and street music influenced by Portuguese traditions."
      }
    ],
    "Serendipity Arts Festival": [
      {
        "heading": "Serendipity Arts Festival",
        "brief": "Multidisciplinary arts event held in Goa, blending theater, music, design, and culinary arts with installations and performances."
      }
    ],
    "Magnetic Fields Festival": [
      {
        "heading": "Magnetic Fields Festival",
        "brief": "Held at Alsisar Mahal, Rajasthan, this EDM festival merges heritage spaces with global music, art, and fashion."
      }
    ],
    "NH7 Weekender": [
      {
        "heading": "Bacardi NH7 Weekender",
        "brief": "India’s leading music festival featuring indie, rock, electronic, and fusion acts across major metros."
      }
    ],
    "Ziro Festival of Music": [
      {
        "heading": "Ziro Festival of Music",
        "brief": "Independent music festival in Arunachal Pradesh, featuring live music in scenic Ziro Valley among Apatani communities."
      }
    ],
    "Kala Ghoda Arts Festival": [
      {
        "heading": "Kala Ghoda Arts Festival",
        "brief": "Mumbai’s open-air street festival for arts, crafts, books, cinema, heritage walks, and urban installations."
      }
    ]
  }

